export const resume:string = `# qiufeihong

Front End Engineer

# Availability

* html, css, js, element-ui
* vue, nodejs, jQuery
* pm2, socket-io, echarts

# Work Experience

* 谷逸科技

# Company Projects
## DeepSphere-nas
* 2019.01-至今 web前端
描述：此项目主要展示系统信息、用户、磁盘信息和服务，实现查看服务信息/主机信息
、网络名、IP设置、用户管理、用户组管理、共享文件夹管理、磁盘信息、S.M.A.R.T、RAID、文件系统、NFS、Samba等功能

* 岗位职责：
从0-1完成前端页面

* 实现技术：
vue全家桶+element-ui


## xAlert
* 2019.01-至今 web前端
描述：此项目主要页面有资产(资产总览,漏洞检测,资产详情)、流量、安全、警报和配置，主页展示日志处理率、数据处理趋势、顶级用户（源站）、威胁活动图（本土化）、最高应用和按状态的案例趋势的子项.

* 岗位职责：
根据交互和视觉方案以及前端框架进行完成页面原型，兼容主流浏览器。

* 实现技术：
ECharts+vue全家桶+element-ui

## xShied
* 2018.09-2018.12 web前端
描述：1. XShied是一个基于FreeBSD，它被安装在计算机上作为网络中的防火墙和路由器存在。
2. XShied通过WEB页面进行配置，升级和管理而不需要使用者具备FreeBSD底层知识。
3. XShied通常被部署作为边界防火墙，路由器，无线接入点，DHCP服务器，DNS服务器和VPN端点。

* 岗位职责：
完成一系列工控页面的开发工作

* 实现技术：
vue全家桶+element-ui

## DeepFileAi-web
* 2018.08-2018.12 web前端
描述：此项目主要完成文档抽取、文档审核、文档对比、文档标注、信息查询、文档配置、深度模型、权限管理等功能

* 岗位职责：
完成登录页面以及文档对比的同步滚动组件

* 实现技术：
nuxt+vue全家桶+elementui+node+ivew

## DeepDefence-web
* 2018.07-2018.12 web前端
描述：clair的目标是能够从一个更加透明的维度去看待基于容器化的基础框架的安全性。
1.Clair会定期从一组已配置的源中提取漏洞元数据，并将其存储在数据库中。
2.客户端使用Clair API来索引其容器映像; 这将创建图像中存在的功能列表，并将它们存储在数据库中。
3.客户端使用Clair API在数据库中查询特定映像的漏洞; 为每个请求关联漏洞和功能，避免重新扫描图像。
4.发生漏洞元数据更新时，可以向警报系统发送更改已发生的通知

* 项目功能: 
通过对容器的layer进行扫描，发现漏洞并进行预警，其使用数据是基于Common Vulnerabilities and Exposures数据库简称CVE, 各Linux发行版一般都有自己的CVE源，而Clair则是与其进行匹配以判断漏洞的存在与否，比如HeartBleed的CVE为：CVE-2014-0160

* 岗位职责：
从0-1完成前端页面

## coder-interview-questions
* 2018.05-2018.07 web前端
描述：公司的一个笔试网站

* 岗位职责：
从0-1完成前端页面

* 实现技术：
vue全家桶+element-ui

* 业绩：前后端面试者可以在线答题，答题通过即可过来技术面试，大大解放了技术人员的劳动力

* 项目链接：http://gushenxing.f3322.net:11093/index

* 实现技术：vue全家桶+element-ui+socket-io

# Personal Project
## vue-element-tack-out（个人项目）
* 2018.11-至今 全栈工程师
描述：此项目是一个外卖后台的管理系统，有买家管理、卖家管理、订单管理、管理员管理、添加商品、添加店铺等功能

* 岗位职责：
从0-1完成管理系统

* 实现技术：
vue全家桶+express+element-ui+MongoDB

* 项目链接：http://106.14.169.12:1234

## 波普大数据研究所门户网站
* 2018.03-2018.07 web前端
描述：学校的研究所网站，主要为了内部人员展示研究项目和讨论最新技术等。我们采用maven构建项目，项目分为前台和后台，放到同一个服务器上，共用一个数据库。

* 功能如下：
1. 前台的功能（登录、注册、查看文章、个人中心、聊天、忘记密码、更改密码、主页、评论留言、联系我们、研究所简介、错误页面等）；
2. 后台的功能（轮播图管理、文章管理、关于我们管理等等）。

* 责任描述：
1. 主要负责业务需求分析
2. 前端页面的设计与实现以及后台jsp的编写
3. 实现查看文章、聊天、评论留言、文章管理等功能。

* 项目技术：
Bootstrap+jQuery+UEditor+Maven+layUI

* 项目链接：http://111.231.55.41/
`
