export const resume:string = `# 仇飞鸿 

24 岁   | 男     |       本科      | 1 年经验      |    中共党员 

# 个人优势 

1. 熟悉前端 MVVM 框架 Vue.js，可以使用 Vue.js 框架从零开发完整的网站 
2. 会运用 echarts、element-ui 等开源组件进行项目开发 
3. 对前端工程化，前后端性能优化有所见解 
4. 基本掌握 JavaScript（含 ES6） 
5. 对页面布局，HTML 语义化有些理解 
6. 掌握 CSS，对页面模块化开发有实战经验 
7. 掌握 Webpack、Gulp 等前端常用的构建工具 
8. 熟悉 uni-app 跨平台应用的前端框架 
9. 了解常见的设计模式，追求开发高质量、高可维护性的代码 
10. 使用过 jQuery，了解 TypeScript 语言，具有良好的面向对象编程的思想 
11. 了解预编译 CSS 技术，如 LESS、Stylus 
12. 熟悉后端语言如 Node.js，掌握 Express、Koa 构建 REST API 
13. 掌握一些常用的运维技术，如 nginx、jenkins 和 gitlab 
14. 熟悉 Git 命令、linux 系统、VSCode 编辑器操作 
15. 具有一定专研精神，敢于挑战自我，解决各种未知问题 

# 期望职位 

web 前端/全栈工程师 

# 工作经历

*  杭州谷逸网络科技有限公司 
web 前端 | 研发部 2018.07—至今 

# 内容： 
1. 依据交互和视觉方案以及前端框架，完成前端重构与开发工作 
2. 在项目组长的安排下完成代码的编写，并确保代码符合前端规范 
3. 根据接口文档，与后端开发协同完成接口的对接开发 

# 业绩： 
1. 在实习期间获得年终奖 

# 项目经历 
##  xAlert 工控安全态势感知平台 
*  web 前端 2019.01—至今 
### 描述： 
1. 资产自动发现 
2. 网络资产可视化 
3. 工控网络数据流向监测 
4. 工控协议深度检测 
5. PLC/DCS 工控设备关键操作监测 
6. PLC/DCS 工控设备探测与 Dos 攻击报警 
7. PLC/DCS 工控设备自身异常行为预警 
8. 工控网络基线白名单环境确定 
9. 工控网络行为异常监测及智能预警 
10. Email/手机/PAD 多种方式实时报警

### 岗位职责： 
1. 设计和封装高阶组件，加快开发效率，重构代码 
2. 用 vue 搭配 element-ui 完成前端页面 
3. 用 axios 完成前后台数据交互 
4. 结合 echarts，网站增加绚丽的特效 
5. 用 jenkins 进行自动化部署 
6. 对大数据量进行性能优化 
7. 用 stylus 使 css 编程语言更有表现力
 

## DeepSphere 超融合网络存储系统 
*   web 前端 2019.01—2019.03 
### 描述：其基于 CEPH 分布式存储方案，能够将存储数据分割、组合、存储，利用高效分布式网存储算法计算数据对象和存储节 点的映射关系。其将普通存储服务器整合成高效，安全，具有动态伸缩和自我修复功能的存储系统。 
1. 国产自主可控 
2. 存储网络 
3. NAS 存储 
4. 存储性能强 
5. 安全可靠 
6. 多样化存储服务 
7. 存储虚拟

### 岗位职责： 
1. 搭建前端框架，配置 webpack 
2. 规范 eslint 用法 
3. 制作各种页面组件或页面模板 
4. 抽离组件，模块化 
5. 完成客户端功能 

## 外卖后台管理系统（个人项目） 
*  全栈工程师 2018.11—至今 
### 描述：是一个外卖后台的管理系统，管理和操作买家、卖家、订单和管理员的数据，建立数据可视化。 

### 岗位职责： 
1. 用 flex 实现页面布局 
2. 用 fetch 实现 http 请求与后台进行数据交互 
3. 用 Express 框架构建 REST API 
4. 数据库用 MongoDB 
5. 用 pm2 部署在阿里云 ECS 实例上
 
### 项目链接：http://tack-out.qiufeihong.top/ 

##  xShied 工控防火墙 

*  web 前端 2018.09—2018.12 
### 描述： 
1. 功能优势：分布式部署、DDos 攻击防护、白加黑名单技术、工控协议指令智能学习、逻辑程序更新报警、学习模式下黑名单 防护、IP/MAC 绑定防护、OPC 动态端口防护、中间人攻击防护、OPC 连接日志显示 
2. 用户体验：全面可视化监控管理、简单易用操作界面、即插即用 
3. 高可用性：旁路保护、冗余电源、时钟同步和低延时 

### 岗位职责： 
1. 使用 HTML 和 CSS 完成一系列工控页面的开发 
2. 用 Vuex 状态存储 
3. 期间改动了大量的 PHP 代码 
4. Vue-router 页面鉴权和路由管理
 
##  xScanner 漏洞扫描系统 
*  web 前端 2018.08—2018.12 
### 描述：
是一款漏洞扫描及数据分析系统，能深度检测和分析系统漏洞，导出漏洞数据。  
### 岗位职责： 
1. 使用 Nuxt 搭配 element-ui 和 ivew 开发前端页面 
2. 用 webpack 打包工具进行模块的按需加载


## DeepDefence-web 容器安全监测平台 
* web 前端 2018.07—2019.03 
### 描述：
主要有 Scanner、Shield、Monitor 三个部分，针对容器镜像漏洞、容器网络防护、容器行为监测提供整体解决方案。 
Scanner 容器镜像扫描，对容器的脆弱性进行静态扫描，分析在某容器版本易受攻击。
Shield 能对容器网络策略进行管理，管理 员统一进行容器间网络防护策略配置、网络事件管理。
Monitor 容器行为监测，用于检测应用程序中进程、文件系统和网络的异 常活动。  
1. 支持多种漏洞数据源 
2. 支持漏洞数据定期更新 
3. 支持主流数据库镜像扫描 
4. 支持上千种业务镜像扫描 
5. 支持提供漏洞元数据 
### 岗位职责： 
1. 用 vue，借助 cli，设计页面骨架，拆分组件 
2. 用 socket-io 完成实时报警系统 

##  xOpAudit 运维堡垒机 

*  web 前端 2018.07—2018.11 
### 描述： 
1. 支持标准协议，不要求客户端，可采用任意客户端访问，不改变管理员的操作习惯，可规定哪些 IP、哪些用户在哪个时间段 访问某个服务器 
2. 支持 x264 高清格式屏幕录像，支持剪切板、磁盘等本地资源以文件形式记录文件传输记录 
3. 支持 ttyrec 格式屏幕录像，以文本形式记录操作日志、命令日志，可设置命令黑/白名单 
4. 支持 Oracle/MSSQL/MySQL/DB2 等主流数据库，记录操作的 SQL 语句，可设置 SQL 语句的黑/白名单 
### 岗位职责： 
1. 用 vue 加上 element-ui 设计页面 
2. 部分组件用 jQuery 实现 
3. 不断完善 web 性能 
4. 完成核心业务代码及前端组件的封装

## 社交主页 
1. Github：https://github.com/qiufeihong2018 
2. 博客：http://www.qiufeihong.top 
3. 掘金：https://juejin.im/user/5bf4d63cf265da61561ee241/posts 
4. CSDN：https://blog.csdn.net/weixin_38465623 

如果有好的hc，求联系。
`
